package prefixSum

/*
*
给你一个整数数组 nums 和一个整数 k ，请你统计并返回 该数组中和为 k 的子数组的个数 。

子数组是数组中元素的连续非空序列。
也就是长度可能为 1 2 3 4
那这种情况下，
排序+双指针会漏算，那如果双重循环行吗？好像也不行，双指针就是两个长度为 2 的子序列了。只能算这个结果，算不了别的

想不出来就先去吃饭

----- 🍅4 ------
回来继续
*/
func subarraySum(nums []int, k int) int {
	// 前缀和 + 哈希表计数：
	// 对于任意 j，若存在 i 使得 prefix[j]-prefix[i]=k，则 nums[i:j] 的和为 k。
	ans := 0
	prefix := 0
	// cnt := map[int]int{0: 1} 表示“前缀和为 0 出现过 1 次”（在数组开始之前）。
	//    这样当 prefix == k 时（也就是从 0..i 这段和为 k），就能正确计数到 1。
	cnt := map[int]int{0: 1}

	for _, v := range nums {
		prefix += v
		ans += cnt[prefix-k]
		cnt[prefix]++
	}
	return ans
}

func subarraySum_b(nums []int, k int) int {
	sum := make([]int, len(nums)+1)
	// 得到前缀和
	for i, v := range nums {
		sum[i+1] = sum[i] + v
	}
	ans := 0
	// 你现在的瓶颈不是“重复计算 sum[j]-sum[i]”（这已经是 O(1) 了），而是“区间数量本身就是 O(n^2)”。
	//要想快，就不能 显式枚举所有区间。
	/**
	for i := 0; i < len(nums); i++ {
		for j := i + 1; j < len(sum); j++ {
			if sum[j]-sum[i] == k {
				ans++
			}
		}
	}
	*/
	/**
	要找s[j]-s[i] =k 的[i,j] 一共有多少对？
	换一下，s[i]=s[j]-k 这就很像两数之和，不过那题求的是有还是没有，有一对就行了，这题求的是有，还要算出有多少个。
	那么就转变成了，枚举每一个 j, 都要找前缀和为 s[j]-k 的下标有多少个
	所以要针对前缀和进行一个计数统计。
	*/
	cnt := make(map[int]int)
	cnt[0] = 1

	for i := 0; i <= len(sum); i++ {
		ans += cnt[sum[i]-k]
		cnt[sum[i]]++
	}

	return ans
}
